APP_TITLE = "Генератор оправданий v1.0"
APP_SUBTITLE = "Если что, это не твоя лень, а просто концепция лени."

GOODBYE_MSG = "Пока. Если что, у меня всегда найдется оправдание для тебя)"
EXCUSE_TITLE = "Оправдание для тебя:"
ANOTHER_ONE_EXCUSE = "Придумаем еще одно? (y/n): "
NO_MORE_MSG = "Ничесе, живем без оправданий? Молодец. Живем по-честному. Или нет?"

# Сообщения об ошибочном вводе
INVALID_INPUT_CATEGORY = "Не понял твой выбор, попробуй ещё раз"
INVALID_INPUT_LEVEL = "Не могу определить выбор, давай ещё раз"

# Допустимые варианты выхода из меню
EXIT_CHOICES = ("й", "q")

# Заголовки меню
MENU_CATEGORY_TITLE = "Выбери категорию оправдания:"
MENU_LEVEL_TITLE = "Выбери уровень абсурдности отмазки:"

# Варианты выбора уровня абсурдности отмазки
LEVEL_OPTIONS = [
    "1. Правдоподобно",
    "2. Полный абсурд\n"
]

# Варианты выбора категории отмазки
CATEGORY_OPTIONS = {
    "1": ("sport", "Тренировки"),
    "2": ("work", "Работа"),
    "3": ("relationships", "Отношения"),
    "4": ("self_development", "Саморазвитие"),
    "5": ("life", "Жизнь вообще")
}